RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/drivers/fsl_enet_qos.c
    if (length > 2U * ENET_QOS_TXDESCRIP_RD_BL1_MASK)
    {
        return kStatus_ENET_QOS_TxFrameOverLen;
    }

    /* Check if the DMA owns the descriptor. */
    txBdRing = (enet_qos_tx_bd_ring_t *)&handle->txBdRing[channel];
    txDesc   = &txBdRing->txBdBase[txBdRing->txGenIdx];
    if (txBdRing->txRingLen == txBdRing->txDescUsed)
    {
        return kStatus_ENET_QOS_TxFrameBusy;
    }

    txDirtyRing      = (enet_qos_tx_dirty_ring_t *)&handle->txDirtyRing[channel];
    txDirty          = &txDirtyRing->txDirtyBase[txBdRing->txGenIdx];
    txDirty->context = context;

    /* Fill the descriptor. */
    if (length <= ENET_QOS_TXDESCRIP_RD_BL1_MASK)
    {
        ENET_QOS_SetupTxDescriptor(txDesc, data, length, NULL, 0, length, true, isNeedTs, kENET_QOS_FirstLastFlag, 0);
    }
    else
    {
        ENET_QOS_SetupTxDescriptor(txDesc, data, ENET_QOS_TXDESCRIP_RD_BL1_MASK, &data[ENET_QOS_TXDESCRIP_RD_BL1_MASK],
                                   (length - ENET_QOS_TXDESCRIP_RD_BL1_MASK), length, true, isNeedTs,
                                   kENET_QOS_FirstLastFlag, 0);
    }

    /* Increase the index. */
    txBdRing->txGenIdx = ENET_QOS_IncreaseIndex(txBdRing->txGenIdx, txBdRing->txRingLen);
    /* Disable interrupt first and then enable interrupt to avoid the race condition. */
    primask = DisableGlobalIRQ();
    txBdRing->txDescUsed++;
    EnableGlobalIRQ(primask);

    /* Update the transmit tail address. */
    txDesc = &txBdRing->txBdBase[txBdRing->txGenIdx];
    if (txBdRing->txGenIdx == 0U)
    {
        txDesc = &txBdRing->txBdBase[txBdRing->txRingLen];
    }
    txDescTail = (uint32_t)(uintptr_t)txDesc & ~ENET_QOS_ADDR_ALIGNMENT;
#if defined(FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET) && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET
    txDescTail = MEMORY_ConvertMemoryMapAddress(txDescTail, kMEMORY_Local2DMA);
#endif
    base->DMA_CH[channel].DMA_CHX_TXDESC_TAIL_PTR = txDescTail;

    return kStatus_Success;
}

/*!
 * brief Gets the sent frame.
 *
 * This function is used to get the sent frame for timestamp and buffer clean operation.
 *
 * param handle The ENET handler pointer.This is the same state pointer used in
 *        ENET_QOS_Init.
 * param txFrame Input parameter, pointer to enet_qos_frame_info_t for saving read out frame information.
 * param channel Read out frame from specified channel.
 */
void ENET_QOS_GetTxFrame(enet_qos_handle_t *handle, enet_qos_frame_info_t *txFrame, uint8_t channel)
{
    assert(handle != NULL);
    assert(channel < handle->txQueueUse);

    enet_qos_tx_dirty_ring_t *txDirtyRing = (enet_qos_tx_dirty_ring_t *)&handle->txDirtyRing[channel];
    enet_qos_frame_info_t *txDirty        = &txDirtyRing->txDirtyBase[txDirtyRing->txConsumIdx];

    (void)memcpy(txFrame, txDirty, sizeof(enet_qos_frame_info_t));

    txDirtyRing->isFull      = false;
    txDirtyRing->txConsumIdx = ENET_QOS_IncreaseIndex(txDirtyRing->txConsumIdx, txDirtyRing->txRingLen);
}

static inline void ENET_QOS_GetRxFrameErr(enet_qos_rx_bd_struct_t *rxDesc, enet_qos_rx_frame_error_t *rxFrameError)
{
    uint32_t rdes2 = rxDesc->buff2Addr;
    uint32_t rdes3 = rxDesc->control;

    (void)memset(rxFrameError, 0, sizeof(enet_qos_rx_frame_error_t));

    if ((rdes2 & ENET_QOS_RXDESCRIP_WR_SA_FAILURE_MASK) != 0U)
    {
        rxFrameError->rxSrcAddrFilterErr = true;
    }
    if ((rdes2 & ENET_QOS_RXDESCRIP_WR_DA_FAILURE_MASK) != 0U)
    {
        rxFrameError->rxDstAddrFilterErr = true;
    }
    if ((rdes3 & ENET_QOS_RXDESCRIP_WR_DE_MASK) != 0U)
    {
        rxFrameError->rxDstAddrFilterErr = true;
    }
    if ((rdes3 & ENET_QOS_RXDESCRIP_WR_RE_MASK) != 0U)
    {
        rxFrameError->rxReceiveErr = true;
    }
    if ((rdes3 & ENET_QOS_RXDESCRIP_WR_OE_MASK) != 0U)
    {
        rxFrameError->rxOverFlowErr = true;
    }
    if ((rdes3 & ENET_QOS_RXDESCRIP_WR_RWT_MASK) != 0U)
    {
        rxFrameError->rxWatchDogErr = true;
    }
    if ((rdes3 & ENET_QOS_RXDESCRIP_WR_GP_MASK) != 0U)
    {
        rxFrameError->rxGaintPacketErr = true;
    }
    if ((rdes3 & ENET_QOS_RXDESCRIP_WR_CRC_MASK) != 0U)
    {
        rxFrameError->rxCrcErr = true;
    }
}

/*!
 * brief Receives one frame in specified BD ring with zero copy.
 *
 * This function will use the user-defined allocate and free callback. Every time application gets one frame through
 * this function, driver will allocate new buffers for the BDs whose buffers have been taken by application.
 * note This function will drop current frame and update related BDs as available for DMA if new buffers allocating
 * fails. Application must provide a memory pool including at least BD number + 1 buffers(+2 if enable double buffer)
 * to make this function work normally. If user calls this function in Rx interrupt handler, be careful that this
 * function makes Rx BD ready with allocating new buffer(normal) or updating current BD(out of memory). If there's
 * always new Rx frame input, Rx interrupt will be triggered forever. Application need to disable Rx interrupt according
 * to specific design in this case.
 *
 * param base   ENET peripheral base address.
 * param handle The ENET handler pointer. This is the same handler pointer used in the ENET_Init.
 * param rxFrame The received frame information structure provided by user.
 * param ringId The ring index or ring number.
 * retval kStatus_Success  Succeed to get one frame and allocate new memory for Rx buffer.
 * retval kStatus_ENET_QOS_RxFrameEmpty  There's no Rx frame in the BD.
 * retval kStatus_ENET_QOS_RxFrameError  There's issue in this receiving.
 * retval kStatus_ENET_QOS_RxFrameDrop  There's no new buffer memory for BD, drop this frame.
 */
status_t ENET_QOS_GetRxFrame(ENET_QOS_Type *base,
                             enet_qos_handle_t *handle,
                             enet_qos_rx_frame_struct_t *rxFrame,
                             uint8_t channel)
{
    assert(handle != NULL);
    assert(channel < handle->rxQueueUse);

